fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
//Ирина Общий модуль - Подключаемые команды
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	ДобавляемыеРеквизиты = Новый Массив;   
	
	ТипРеквизитаДата = Новый ОписаниеТипов("Дата", ,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)); 
	ТипРеквизитаСумма = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(10, 2));
	
	НовыйРеквизитФормыДатаНачала = Новый РеквизитФормы("ВКМ_ДатаНачалаДоговора", ТипРеквизитаДата,, "Дата начала договора");
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормыДатаНачала); 
	
 	НовыйРеквизитФормыДатаОкончания = Новый РеквизитФормы("ВКМ_ДатаОкончанияДоговора", ТипРеквизитаДата,, "Дата окончания договора");
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормыДатаОкончания);  
			
	НовыйРеквизитФормыСуммаАбонентскойПлаты = Новый РеквизитФормы("ВКМ_СуммаАбонентскойПлаты", ТипРеквизитаСумма,, "Сумма абонентской платы");
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормыСуммаАбонентскойПлаты);  
		
	НовыйРеквизитФормыСтоимостьЧасаРаботы = Новый РеквизитФормы("ВКМ_СтоимостьЧасаРаботы", ТипРеквизитаСумма,, "Стоимость часа работы");
	
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормыСтоимостьЧасаРаботы); 
		
	ЭтотОбъект.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
		
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 

//@skip-check module-structure-top-region
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()  
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда 
								   
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
		
	ИначеЕсли Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание 
		                           И Элементы.Найти("ВКМ_ДатыНачалаОкончания") <> Неопределено 
								   И Элементы.Найти("ВКМ_СуммаСтоимостьЧаса") <> Неопределено  Тогда 
								   								   
		Элементы.Удалить(Элементы.ВКМ_ДатыНачалаОкончания);						   
		Элементы.Удалить(Элементы.ВКМ_СуммаСтоимостьЧаса);						   
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти     
//Ирина Конец
